In [1]:
import requests
import pandas as pd

In [6]:
df = pd.read_json("personal.json")

In [7]:
df

                                             workers
0  {'nombre': 'Ana', 'edad': 34, 'experiencia': 5...
1  {'nombre': 'Eva', 'edad': 37, 'experiencia': 2...
2  {'nombre': 'Marta', 'edad': 27, 'experiencia':...
3  {'nombre': 'Paula', 'edad': 30, 'experiencia':...

In [8]:
df.to_csv("personal.csv")

In [12]:
df

                                             workers
0  {'nombre': 'Ana', 'edad': 34, 'experiencia': 5...
1  {'nombre': 'Eva', 'edad': 37, 'experiencia': 2...
2  {'nombre': 'Marta', 'edad': 27, 'experiencia':...
3  {'nombre': 'Paula', 'edad': 30, 'experiencia':...

In [13]:
df.to_excel("personal.xlsx")

In [16]:
df_personal_excel = pd.read_excel("personal.xlsx", index_col=0)

In [17]:
df_personal_excel

                                             workers
0  {'nombre': 'Ana', 'edad': 34, 'experiencia': 5...
1  {'nombre': 'Eva', 'edad': 37, 'experiencia': 2...
2  {'nombre': 'Marta', 'edad': 27, 'experiencia':...
3  {'nombre': 'Paula', 'edad': 30, 'experiencia':...

In [21]:
df.to_csv("files/personal.csv")

In [26]:
import json

with open('personal.json', 'r') as f:
    personal = json.load(f)

with open('personal.json', 'w') as f:
    json.dump(personal,f,indent=4)

In [ ]:
personal.keys() #buscar la key

dict_keys(['workers'])

In [38]:
print(df)

                                             workers
0  [{'nombre': 'Ana', 'edad': 34, 'experiencia': ...

In [ ]:
df = pd.json_normalize(personal['workers']) #como hay una lista dentro del diccionario, hay que acceder con la key['']

In [48]:
print(df)

  nombre  edad  experiencia   nivel  salario mascota
0    Ana    34            5  Senior    50000   gatos
1    Eva    37            2     Mid    35000     NaN
2  Marta    27            1  Junior    25000     NaN
3  Paula    30            3     Mid    35000     NaN